app/controllers/gamelinks_controller.rb

  def about
    @products = Product.page(params[:page]).per(PER)
    @members = Member.page(params[:page]).per(PER)
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
SELECT  "members".* FROM "members" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "members"

  def game
    @games = Game.page(params[:page]).per(PER)
---
SELECT  "games".* FROM "games" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def browsergame
    @browsers = Browser.page(params[:page]).per(PER)
---
SELECT  "browsers".* FROM "browsers" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]